SkylerMchp/pic32basic/5_Analog_Interfacing/Demo5_ADC/user.c
/******************************************************************************/
/* Files to Include                                                           */
/******************************************************************************/

#ifdef __XC32
#include <xc.h>          /* Defines special function registers, CP0 regs  */
#endif

#include <stdint.h>          /* For uint32_t definition                       */
#include <stdbool.h>         /* For true/false definition                     */
#include "user.h"            /* variables/params used by user.c               */
#include "ADC.h"

/******************************************************************************/
/* User Functions                                                             */

/******************************************************************************/


void InitGPIO(void) {
    /* Setup functionality and port direction */
    // Enable analog input for potentiometer (AN8 on pin RB13)
    ANSELBbits.ANSB13 = 1;
    // LED output
    // Disable analog mode
    ANSELGbits.ANSG6 = 0;
    ANSELBbits.ANSB11 = 0;
    ANSELGbits.ANSG15 = 0;
    // Set directions to output
    TRISGbits.TRISG6 = 0;
    TRISBbits.TRISB11 = 0;
    TRISGbits.TRISG15 = 0;
    TRISDbits.TRISD4 = 0;
    // Turn off LEDs for initialization
    LD1_PORT_BIT = 0;
    LD2_PORT_BIT = 0;
    LD3_PORT_BIT = 0;
    LD4_PORT_BIT = 0;
    // Button inputs
    // Disable analog mode
    ANSELAbits.ANSA5 = 0;
    // Set directions to input
    TRISAbits.TRISA5 = 1;
    TRISAbits.TRISA4 = 1;
}

void InitApp(void) {
    InitGPIO();
    initWiFIREadc();
}

void Delay(int n) {
    volatile int i;
    for (i = 0; i < n; i++) {
    }
}

void Scan_LEDs(void) {
    int LED_state = 1; // 1 on (initial value), 0 off
    int delay_count;

    while (1) {
        // delay_count = ReadPotentiometerWithADC()*1000 + 300000;
        delay_count = ReadPotentiometerWithADC()*1000 + 300000;
        
        LD1_PORT_BIT = LED_state;
        Delay(delay_count);
        LD2_PORT_BIT = LED_state;
        Delay(delay_count);
        LD3_PORT_BIT = LED_state;
        Delay(delay_count);
        LD4_PORT_BIT = LED_state;
        Delay(delay_count);

        LED_state = 1 - LED_state; // next time, set LEDs to opposite state
    }
}
